import React, { useState } from "react";
import { X, Plus } from "lucide-react";

import "./fqa.css";

const FAQ = () => {
  const [openIndex, setOpenIndex] = useState(null);

  const faqs = [
    {
      question: "ما هو وفي وما الخدمة التي يقدمها؟",
      answer:
        "تقدم وفي خدمة الضمان وحماية الأموال (كطرف مستقل) لكل من طرفي المعاملة (البائع والمشتري) لحين إنهاء إجراءات المعاملة وبالشروط المتفق عليها بين الأطراف ",
    },
    {
      question: "كيف يمكنني التسجيل في وفي؟",
      answer: "يمكنك التسجيل عبر الموقع أو التطبيق للاستفادة من الخدمة واتباع الخطوات الموضحة لإنشاء حساب جديد، كما يمكنك التواصل مع خدمة العملاء لمزيد من المساعدة أو في حال الرغبة بالتسجيل بميزة الوسيط الضامن (وفي أعمال) المخصص للوسطاء بكافة المجالات.",
    },
    {
      question: "هل وفي آمن؟",
      answer: "وفي عبارة عن خدمة معتمدة من شركة سعودية مسجلة لدى وزارة التجارة باسم (شركة وفي للتقنية المالية) ورقم سجل “403043377” وتقدم الخدمة من خلال بنوك سعودية ( الراجحي – الإنماء – بنك الخليج الدولي ) وتستخدم بوابات دفع أمنة ( ميسر – هايبر باي ) ومعتمدة من البنك المركزي لضمان الأموال وإرسالها",
    },
    {
      question: "ما هي طرق الدفع المتاحة عبر وفي",
      answer: "يمكن استخدام طرق دفع متعددة مثل بطاقات الائتمان (فيزا – مدى – مساتر كارد) وابل باي والتحويل البنكي وخدمة التقسيط من خلال Tabby",
    },
    {
        question: "ماهي رسوم خدمة وفّي ومن يقوم بدفعها وهل الرسوم شاملة عمولة حراج؟",
        answer: "عمولتنا ٤٪ من قيمة المبلغ المدفوع لماذا يتم أخذ عمولة؟ لأن خدمة وفي تقدم للطرفين للحفاظ على جودة وقيمة الخدمة المقدمة بالحفاظ على القيمة المالية المدفوعة مقابل رسوم رمزية تخصم من قيمة المعاملة نفسها. كما أن رسوم خدمة وفي لا تشمل أي معاملات أو رسوم خارج المنصة",
      },
      {
        question: "ما هو الحد الأقصى لقيمة المعاملات على تطبيق وفّي؟",
        answer: "لا يوجد حد أقصى لقيمة المعاملات الموجودة على تطبيق وفي ولمزيد من التفاصيل برجاء التواصل مع فريق خدمة العملاء لخدمتك بشكل أفضل على الرقم (966553043449)",
      },
      {
        question: "هل يتوفر توثيق رسمي للمعاملات التي تتم عبر وفّي؟",
        answer: "نعم، يمكن توثيق المعاملات التي تتم عبر وفّي وفقًا للقوانين المحلية والشروط المتفق عليها",
      },
      {
        "question": "ما آلية الشحن عبر تطبيق وفّي؟",
        answer: "المنتجات المادية: توفر وفّي خدمة ضمان مبلغ الشحن، حيث يتم حجزه مقدمًا مع مبلغ السلعة عند تفعيل خاصية الشحن. يتم شحن المنتجات عبر شركات الشحن وفقًا لاتفاق الطرفين، مع إرفاق بوليصة الشحن لفريق وفّي. \n\nالحسابات والاشتراكات: في حال كان المنتج إلكترونيًا وترغب في بيعه عبر التطبيق، يُرجى التواصل مع خدمة العملاء لتوضيح آلية تسليم السلعة عبر الرقم الموضح أعلاه."
      },

      
      {
        question: "كيف يمكنني التواصل مع خدمة العملاء أو الدعم الفني لتطبيق وفّي ",
        answer: "يمكنك التواصل معنا عبر الواتساب أو هاتفياً عبر الرقم التالي: 966553043449",
      },


      { 
        question: "ما آلية التصعيد لوفّي؟", 
        answer: "1- يمكن لأي من البائع أو المشتري أن يقوم بالتصعيد لوفّي بعد إتمام عملية الدفع من خلال الأيقونة المحددة لهذا الغرض وتعبئة بيانات الشكوى المتعلقة بذلك، وفي هذه الحالة سنقوم بإيقاف المعاملة مؤقتًا لحين حل الخلاف بين الأطراف.\n\n2- عند التصعيد لوفّي وفقًا للفقرة السابقة، سيقوم فريق تسوية المنازعات بالتواصل مع كل من البائع والمشتري في مدة أقصاها (24) ساعة للنظر في الشكوى، وذلك عبر المكالمات الهاتفية أو مكالمات الإنترنت أو بهما معًا، ويلتزم البائع والمشتري بتزويد الفريق بالوثائق المطلوبة خلال المهلة التي يحددها.\n\n3- يترتب على التصعيد لوفّي استكمال المعاملة أو إلغاؤها مع التعويضات أو بدونها حسب قرار فريق تسوية المنازعات، إما بإرجاع المبلغ المالي للمشتري أو تحويله للبائع مخصومًا منه عمولة وفّي، وذلك في كلا الحالتين خلال سبعة أيام عمل من إغلاقها، ويكون هذا القرار ملزمًا للبائع والمشتري.\n\n4- إذا كان موعد التصعيد لوفّي وإيقاف المعاملة مؤقتًا قبل استلام المشتري للمنتج، فتُعاد له قيمة المعاملة بعد خصم الرسوم المرتبطة بها، في حال لم يتم تسليم المنتج له واتفق الطرفان على ذلك أو قررت لجنة التحكيم لدى وفّي ذلك خلال سبعة أيام من إغلاق المعاملة.\n\n5- يُعدّ إبداء المشتري لرفضه المنتج بعد استلامه خلال مدة إجراء الفحص تصعيدًا لوفّي، وإذا قرر فريق تسوية المنازعات إلغاء المعاملة في هذه الحالة، فتعاد قيمتها للمشتري بعد خصم الرسوم المرتبطة بها خلال سبعة أيام، بالإضافة إلى التعويضات -إن وجدت- بعد استكمال إجراءات إعادة المنتج مرة أخرى للبائع واستلامه من "
      },   


      {
        question: "ما هي سياسة تحويل المبلغ للبائع أو في حال عدم تأكيد استلام المنتج من قبل المشتري؟", 
        answer:  "يتم البدء بإجراءات تحويل المبالغ المالية بعد إغلاق المعاملة بنجاح خلال سبعة أيام عمل.\n\nيجب على المشتري تأكيد استلام المنتج خلال مدة الفحص المحددة، والتي تبلغ كحد أقصى 48 ساعة للمنتجات العينية، تبدأ من تاريخ وساعة استلام المنتج. في حال عدم تأكيد الاستلام خلال هذه المدة، سيتم إغلاق المعاملة تلقائيًا، وتحويل المبلغ إلى البائع خلال سبعة أيام عمل."
      }, 


      
      { 
        question: "هل يمكنني استخدام خدمة وفّي خارج المملكة العربية السعودية؟", 
        answer: "خدمة وفّي متاحة حالياً داخل المملكة العربية السعودية فقط"} ,

        
      { 
        question:  "ما آلية بيع المنتجات الرقمية كبطائق الشحن والتذاكر وما يشملها؟", 
        answer: "تتيح لك وفي عرض و بيع المنتجات الرقمية عبر تطبيقها وذلك بحجب الأكواد أو أرقام التذاكر وعدم مشاركتها مع الطرف الأخر الا بعد الدفع ونحن مسؤولين عن المبلغ المحجوز داخل وفي فقط وليس عن صلاحية التذكرة أو الكود"} ,
      
  ];


  const toggleFAQ = (index) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <div className="faq-section">
    <div className=" container">
      <h1 className="faq-title text-center mb-5 mt-5">الأسئلة الشائعة</h1>

      {faqs.map((faq, index) => (
        <div key={index} className="faq-item">
          <div className="faq-question" onClick={() => toggleFAQ(index)}>
          <span className="faq-icon">
  {openIndex === index ? <X size={20} /> : <Plus size={20} />}
</span>
            <h2 class="text-muted">{faq.question}</h2>
            
          </div>
          {openIndex === index && <p className="faq-answer text-end">{faq.answer}</p>}
        </div>
      ))}
    </div>
    </div>
  );
};

export default FAQ;
